#### RebarPropagation Members

---

|  |
| --- |
| RebarPropagation Class   Methods   See Also |

The  RebarPropagation  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | AlignByFace | It will copy the source rebars, will align them to the destination face based on the source face and adapt them to destination host. |
| Public method Static member | AlignByHost | It will copy the source rebars, will align them in the same way as how the source host is aligned to destination host and will adapt them to the destinaion host. |

# See Also

RebarPropagation Class

Autodesk.Revit.DB.Structure Namespace